### Shared environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_uuid.api_access_as_user: Refreshing state... [id=82728a37-6e51-8699-3323-ddc404d0fe13]
data.azuread_application_published_app_ids.well_known: Reading...
azuread_application_registration.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e]
azuread_application_registration.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_service_principal.msgraph: Reading...
azuread_application_redirect_uris.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/redirectUris/SPA]
azuread_service_principal.web: Refreshing state... [id=/servicePrincipals/febd01e6-38ac-48b4-ad27-8dcb216ea6b6]
azuread_application_identifier_uri.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/identifierUris/YXBpOi8vNzU3YjQ5YzgtMzMwNS00ZDg1LWIzY2QtY2RkYWUxZjYxNWNm]
azuread_application_permission_scope.api_access_as_user: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/permissionScopes/82728a37-6e51-8699-3323-ddc404d0fe13]
azuread_service_principal.api: Refreshing state... [id=/servicePrincipals/7f571a01-5c51-42f8-aefd-040416f5845a]
data.azuread_service_principal.msgraph: Read complete after 2s [id=/servicePrincipals/cb86be44-f8dd-45b1-a3cd-70f5a88e8b96]
azuread_application_api_access.web_api: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/apiAccess/757b49c8-3305-4d85-b3cd-cddae1f615cf]
azuread_application_api_access.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/apiAccess/00000003-0000-0000-c000-000000000000]
azuread_application_api_access.web_graph: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/apiAccess/00000003-0000-0000-c000-000000000000]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01MWNmMDJmYi00Mjc3LTQ3NWQtOGYxNC05MTg3ZjY4YTI4NzM7b2JqZWN0SWQ9NDQzM2MyOWEtMDE0NS00ZjI4LTkzY2YtMTZiY2RkMzhiZmViO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
azurerm_container_registry.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.acr_push will be created
  + resource "azurerm_role_assignment" "acr_push" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4433c29a-0145-4f28-93cf-16bcdd38bfeb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>